Revit 2026 API

# XYZSubtract Method

---

Subtracts the specified vector from this vector and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Subtract(
	XYZ source
)
```
```vb
Public Function Subtract (
	source As XYZ
) As XYZ
```
```cpp
public:
XYZ^ Subtract(
	XYZ^ source
)
```
```fsharp
member Subtract :
        source : XYZ -> XYZ
```

#### Parameters

source XYZ
    The vector to subtract from this vector.

#### Return Value

XYZThe vector equal to the difference between the two vectors.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when source is . |

The subtracted vector is obtained by subtracting each coordinate of the specified vector from the corresponding coordinate of this vector.

#### Reference

XYZ Class

Autodesk.Revit.DB Namespace